[
	{
		"codingforkids": "Coding for Kids [Updated 2021]",
		"ultimateguide": "The Ultimate Guide for Parents in 2021",
		"CodingforKids": "Coding for Kids",
		"Develope": "Develope 21th Century Skills",
		"Minecraft": "Minecraft",
		"MinecrateModding": "Minecrate Modding",
		"Electronic": "Electronic Coding Kits",
		"codingconnectedtoys": "Coding Connected Toys",
		"whatiscoding": "What is coding?",
		"whatiscodingp1": "Coding is the method of giving a computer instructions to perform a specific task. You may also hear coding referred to as",
		"softwareprogramming": "software programming or computer programming.",
		"whatiscoding2": "These instructions are communicated using a language that computers can understand, like visual blocks, JavaScript, Python, and C.",
        "whatiscodingp3": "Code fuels our world’s technology. From microprocessors in everyday items like refrigerators and water heaters to sophisticated programs that operate our cars and buildings, learning to code has become an essential element of a child’s education.",
        "whatiscodingforkids":"What is coding for kids?",
        "whatiscodingforkidsp1":"Learning to code at a young age is a great opportunity for kids and teens to develop their problem-solving and critical thinking skills, while building the necessary focus and organization to see projects through to completion.",
        "whatiscodingforkidsp2":"With Tynker, coding begins with drag-and-drop visual programming in which kids connect blocks together to make programs. Visual programming teaches the fundamental concepts without typing or syntax by placing the focus on the logic behind the code.",
        "whatiscodingforkidsp3":"Once they’ve learned the basics, kids can transition to real-world programming languages like Python, JavaScript, and C. From online coding courses and games to in-person coding instruction and offline learning, there are endless coding resources available. The best coding platforms and programs make learning fun and engaging, giving kids of all ages and experience levels the ability to code.",
        "whyshouldkidslearntocode":"Why should kids learn to code?",
        "whyshouldkidslearntocode2":"As technology becomes more prevalent in our lives, code is revolutionizing every aspect of today’s world – think self-driving cars, robot-assisted surgery, social media, and more.",
        "whyshouldkidslearntocode3":"Coding is a 21st century skill that motivates kids of all ages to become makers of technology while preparing them for countless job opportunities. In the meantime, kids who code excel at school in math and science, even reading!",
        "isithardtolearn":"Is it hard for kids to learn to code?",
        "isithardtolearnp1":"With so many great services available, learning to code has never been easier! For example, Scratch and Tynker provide innovative visual coding languages that make coding fun. At Tynker, Our award-winning platform captivates young coders because its story-driven strategy motivates them to complete more and more lessons.",
        "howToTeachKidsToCode":"How to teach your kids to code",
        "howToTeachKidsToCode2":"Kids of all ages – from pre-readers to high-schoolers – can learn to code. The same fundamental concepts such as sequencing, abstraction, repetition, conditional statements, loops, and functions can be introduced to kids of any age or experience level.",
        "howToTeachKidsToCode3":"The range of coding education solutions spans far and wide! There are apps, websites, camps, live online classes, and personal tutors, so it’s important to choose the method that works best for your child.",
        "howToTeachKidsToCode4":"Websites like Scratch have development environments, allowing kids to make amazing creations by learning from the community.",
        "howToTeachKidsToCode5":"Kids who’d like more guidance can benefit from the structured and scaffolded coding curriculum Those who prefer to learn with a tutor can learn to code at an after-school program at school, home or a summer camp.",
        "howToTeachKidsToCode6":"What are the best programming languages for kids?",
        "howToTeachKidsToCode7":"There are many popular programming languages available to kids. Your child can select one based on their age and experience level. Visual programming languages are a great place to start! We recommend kids begin to learn to code with a block coding language like those offered by Tynker and Scratch. Once they’ve learned the basics, they can transition to text-based coding.",
        "howToTeachKidsToCode8":"Learn to code apps",
        "learnToCodeApp":"These days there’s an app for everything — including coding for kids — catering to both pre-readers and older kids. Apps offer coding adventures and games to younger kids and provide the opportunity for older kids to build their own apps and games. ",
        "learnToCodeApp1":"Picture-based block coding apps (Ages 5-7)",
        "learnToCodeApp2":"- Play through coding challenges and coding games for kids or build simple apps in Tynker Junior and ScratchJr.",
        "learnToCodeApp3":"Text-based block coding apps (Ages 8-11)",
        "learnToCodeApp4":"-Download Hopscotch or Tynker from the app store and learn to code by creating apps, games, and projects with text-based coding blocks.",
        "learnToCodeOnline":"Learn to code online",
        "learnToCodeOnline1":"Enrolling in an online website is an excellent starting point for independent learners. We recommend solutions focused on making learning to code easy and fun.",
        "learnToCodeOnline2":"Game-based learning",
        "learnToCodeOnline3":"- Game-based platforms such as Tynker and the challenges on Code.org motivate kids to use code to complete game levels.",
        "learnToCodeOnline4":"Independent learning with Scratch",
        "learnToCodeOnline5":"- Scratch from MIT is a great way of getting started with code. Although they don’t have courses, there’s a vibrant community to learn from.",
        "learnToCodeOnline6":"Online courses",
        "learnToCodeOnline7":"Enroll in a Python or JavaScript course on Codecademy or Tynker or learn to code with Processing on Khan Academy",
        "learnToCodeOnline8":"Build an app",
        "learnToCodeOnline9":"Learn to build your own iOS app using Swift. Start with these Swift resources and get the Swift Playgrounds app by Apple.",
        "learnToCodeOnline10":"Use a book",
        "learnToCodeOnline11":"Learn by following along with books like Mission Python, Super Scratch Programming Adventure, or Coding with Minecraft.",
        "learnToCodeOnline12":"Code with toys",
        "learnToCodeOnline13":"You can learn to code with toys such as a Parrot Mambo Drone, LEGO Mindstorms, or the Harry Potter Kano Coding Kit.",
        "learnToCodeOnline14":"Where can my child learn to code?",
        "learnToCodeOnline15":"If you prefer live instruction for your child, explore camp and tutoring options. Some schools offer opportunities for elementary and middle-schoolers to learn to code through in-class instruction or after-school coding classes.",
        "learnToCodeOnline16":"Schools",
        "learnToCodeOnline17":"- Take advantage of your school’s coding programs. It’s a great way to get kids involved in computer science and STEM at a young age.",
        "learnToCodeOnline18":"Tutoring Centers",
        "learnToCodeOnline19":"- Enroll your child in an after-school coding class at your school or nearest CodeLab learning center.",
        "learnToCodeOnline20":"Camps",
        "learnToCodeOnline21":"- Participate in a summer camp such as CodeLab, SheCodes, or TeensCanCode.",
        "learnToCodeOnline22":"Tutoring Services",
        "learnToCodeOnline23":"Hire a personal tutor from services such as BigTech, FaradTech or CodeLab.",
        "learnToCodeOnline24":"What offline resources can help my child learn to code?",
        "learnToCodeOnline25":"Kids can learn computing concepts without a computer or tablet. Hands-on activities using crayons, playing cards, and board games are excellent options to teach coding to kids.",
        "learnToCodeOnline26":"Unplugged learning",
        "learnToCodeOnline27":"- Activities found via CS Unplugged teach kids computing concepts offline.",
        "learnToCodeOnline28":"Board games",
        "learnToCodeOnline29":"- Preschoolers can learn to code using fun board games such as Robot Turtles!",
        "learnToCodeOnline30":"Learning to code has endless benefits! From preparing kids for future job opportunities to developing their soft skills and academic skills, there are many reasons for kids to learn how to code. And, thanks to the growing awareness of the importance of learning to code, kids have plenty of options to choose from. Just find the best solution for your child and get them coding!"
	}
]
